# А нужны ли им скобочки??? На работу программы не влияет вообще никак.
text_1 = ("1.Создать список и заполнить его элементами различных типов данных.\nРеализовать скрипт проверки типа данных каждого элемента.\nИспользовать функцию type() для проверки типа.\nЭлементы списка можно не запрашивать у пользователя, а указать явно, в программе.")
text_2 = ("2.Для списка реализовать обмен значений соседних элементов,\nт.е. Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.\nПри нечетном количестве элементов последний сохранить на своем месте.\nДля заполнения списка элементов необходимо использовать функцию input().")
text_3 = ("3.Пользователь вводит месяц в виде целого числа от 1 до 12.\nСообщить к какому времени года относится месяц (зима, весна, лето, осень).\nНапишите решения через list и через dict.")
text_4 = ("4.Пользователь вводит строку из нескольких слов, разделённых пробелами.\nВывести каждое слово с новой строки. Строки необходимо пронумеровать. Если в слово длинное, выводить только первые 10 букв в слове.")

text_5_1 = ("5.Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.\nУ пользователя необходимо запрашивать новый элемент рейтинга.\nЕсли в рейтинге существуют элементы с одинаковыми значениями,\nто новый элемент с тем же значением должен разместиться после них.")
text_5_2 = ("Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.")
text_5_3 = ("Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].")

text_6 = ("6.*Реализовать структуру данных «Товары».\nОна должна представлять собой список кортежей.\nКаждый кортеж хранит информацию об отдельном товаре.\nВ кортеже должно быть два элемента — номер товара и словарь с параметрами (характеристиками товара: название, цена, количество, единица измерения).\nСтруктуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.")
